Revit 2024 API
PipeFittingAndAccessoryConnectorData.Angle Property
 The angle of the fitting, Units:(rad).
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public double Angle { get; }
Visual Basic
Public ReadOnly Property Angle As Double
	Get
Visual C++
public:
property double Angle {
	double get ();
}
See Also
PipeFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Plumbing Namespace